#+title: coding interview patterns
** code blocks
#+begin_src shell :results output
  python3 palindrome_checker.py
  python3 triplet_sum.py
  python3 pair_sum.py
  ls -lha
#+end_src

#+RESULTS:
#+begin_example
INPUT                               | EXPECTED   | ACTUAL     | STATUS
---------------------------------------------------------------------------
'A man, a plan, a canal: Panama'    | True       | True       | PASS ✅
'race a car'                        | False      | False      | PASS ✅
'' (whitespace/empty)               | True       | True       | PASS ✅
' ' (whitespace/empty)              | True       | True       | PASS ✅
'a.'                                | True       | True       | PASS ✅
'.,'                                | True       | True       | PASS ✅
'12321'                             | True       | True       | PASS ✅
'No 'x' in Nixon'                   | True       | True       | PASS ✅
'0P'                                | False      | False      | PASS ✅
Test Case            | Input                     | Result
----------------------------------------------------------------------
Standard Case        | [-4, -1, -1, 0, 1, 2]     | [[-1, -1, 2], [-1, 0, 1]]
Empty List           | []                        | []
Small List           | [0]                       | []
All Zeros            | [0, 0, 0, 0]              | [[0, 0, 0]]
No Triplets          | [1, 2, 3, 4]              | []
Two Triplets         | [-2, 0, 0, 2, 2]          | [[-2, 0, 2]]
Test: Unsorted Input       | Result: [1, 3]
Test: Minimum Valid List   | Result: [0, 1]
Test: No Possible Solution | Result: []
Test: Negative Numbers     | Result: [0, 1]
Test: Double-use Prevention | Result: []
total 52K
drwxr-xr-x 1 rgroot rgroot  210 May  6 01:30 .
drwxr-xr-x 1 rgroot rgroot 2.8K May  5 23:38 ..
-rw-r--r-- 1 rgroot rgroot 5.4K May  6 01:30 coding_interview_patterns.org
-rw-r--r-- 1 rgroot rgroot  31K May  5 14:12 coding_interview_patterns.org~
-rw-r--r-- 1 rgroot rgroot 1.2K May  6 01:17 pair_sum.py
-rw-r--r-- 1 rgroot rgroot 2.0K May  6 01:10 palindrome_checker.py
-rw-r--r-- 1 rgroot rgroot 1.9K May  6 01:13 triplet_sum.py
#+end_example

